In [2]:
%load_ext sql

In [4]:
%sql mysql+pymysql://w-alkao:mypassword@localhost

In [5]:
%sql SHOW DATABASES;

 * mysql+pymysql://w-alkao:***@localhost
8 rows affected.

[('ap',),
 ('ex',),
 ('information_schema',),
 ('livestock',),
 ('mysql',),
 ('om',),
 ('performance_schema',),
 ('sys',)]

In [6]:
%sql USE ap

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

### Work with string data

#### Summary of the string functions

In [39]:
%%sql # concatenates strings

SELECT CONCAT('Last', 'First') AS result

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('LastFirst',)]

In [42]:
%%sql # concatenates string with the specified separator string

SELECT CONCAT_WS('*', 'Last', 'First', 'Second') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('Last*First*Second',)]

In [43]:
%%sql # same result with the precedent

SELECT CONCAT('Last', '*', 'First', '*', 'Second') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('Last*First*Second',)]

In [44]:
%%sql # returns string with any leading spaces removed

SELECT LTRIM('           MySql            ') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('MySql            ',)]

In [18]:
%%sql # returns string with any trailing spaces removed

SELECT RTRIM('            MySql    ') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('            MySql',)]

In [45]:
%%sql # returns string with any leading and trailing spaces removed

SELECT TRIM('      MySql     ') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('MySql',)]

In [46]:
%%sql # returns strings without leading ****

SELECT TRIM(LEADING '*' FROM '********MyName******') AS resutl

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('MyName******',)]

In [47]:
%%sql # returns strings without trailing *****

SELECT TRIM(TRAILING '*' FROM '********MyName******') AS resutl

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('********MyName',)]

In [48]:
%%sql # returns strings without leading and trailing *****

SELECT TRIM(BOTH '*' FROM '********MyName******') AS resutl

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('MyName',)]

In [23]:
%%sql # returns a string converted to lowercase letters

SELECT LOWER('MySQL') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('mysql',)]

In [24]:
%%sql # returns the string converted to uppercase letters

SELECT UPPER('mysql');

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('MYSQL',)]

In [58]:
%%sql # returns 3 number of character from the beginning of the string

SELECT LEFT('Mysql', 3) AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('Mys',)]

In [59]:
%%sql # returns 3 numbers of character from the end of the string

SELECT RIGHT('Mysql', 3) AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('sql',)]

In [66]:
%%sql # returns the substring from the string starting at position 7 with 4 character long

SELECT SUBSTRING('(559) 555-1212', 7, 4) AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('555-',)]

In [72]:
%%sql # same with the previous, starting at position 6 with 11 characters long

SELECT SUBSTRING('I am learing MySQL', 6, 11) AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('learing MyS',)]

In [64]:
%%sql # returns the substring before the seconde '.'

SELECT SUBSTRING_INDEX('https://www.github.com', '.', 2) AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('https://www.github',)]

In [65]:
%%sql # returns the substring before the seconde '.' starting from the end

SELECT SUBSTRING_INDEX('https://www.github.com', '.', -2) AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('github.com',)]

In [49]:
%%sql # returns the number of characters in the string

SELECT LENGTH('MySQL') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(5,)]

In [50]:
%%sql # same with precedent with spaces added

SELECT LENGTH('    MySQL   ') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(12,)]

In [54]:
%%sql # returns the positions of the first occurence of 'sql' in text

SELECT LOCATE('sql', 'https://www.mysql.com/mysql') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(15,)]

In [57]:
%%sql # returns the positions of the first occurence of 'sql' in text starting at the position 16

SELECT LOCATE('sql', 'https://www.mysql.com/mysql', 16) AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(25,)]

In [77]:
%%sql # replace all '5' with '*'

SELECT REPLACE('(559) 555-1212', '5', '*') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('(**9) ***-1212',)]

In [87]:
%%sql # insert 'Myrach's' at position 1 and replace 3 character in the string

SELECT INSERT('MySQL', 1, 3, "Murach's ") AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[("Murach's QL",)]

In [88]:
%%sql # returns the string with the characters in reverse order

SELECT REVERSE('MySQL') AS result;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('LQSyM',)]

In [ ]:
%%sql #

SELECT